# DistanceToCutMark Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DistanceToCutMark Property
ParameterTypeId Class See Also
---
"Distance to Cut Mark"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DistanceToCutMark { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DistanceToCutMark As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DistanceToCutMark {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace